; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob29) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate3)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate2)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear pallet9)
	(at pallet10 depot0)
	(clear crate5)
	(at truck0 depot2)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(at crate1 distributor2)
	(on crate1 pallet7)
	(at crate2 distributor2)
	(on crate2 crate1)
	(at crate3 distributor1)
	(on crate3 crate0)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(at crate5 depot0)
	(on crate5 pallet10)
)

(:goal (and
		(on crate0 pallet9)
		(on crate1 pallet4)
		(on crate2 pallet5)
		(on crate3 pallet8)
		(on crate4 pallet10)
		(on crate5 crate0)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 6
2. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet3)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 0 of 6
3. (lift hoist0 crate5 pallet10 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 pallet10)
   added: (lifting hoist0 crate5) (clear pallet10)
   goals met: 0 of 6
4. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   goals met: 0 of 6
5. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 6
6. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 6
7. (unload hoist7 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist7)
   added: (lifting hoist7 crate5)
   goals met: 0 of 6
8. (lift hoist4 crate3 crate0 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate0)
   added: (lifting hoist4 crate3) (clear crate0)
   goals met: 0 of 6
9. (load hoist4 crate3 truck1 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck1) (available hoist4)
   goals met: 0 of 6
10. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 6
11. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 0 of 6
12. (unload hoist5 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 0 of 6
13. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 0 of 6
14. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 0 of 6
15. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 0 of 6
16. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 0 of 6
17. (drop hoist0 crate4 pallet10 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet10)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet10)
   goals met: 1 of 6
18. (drop hoist5 crate3 pallet8 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet8)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet8)
   goals met: 2 of 6
19. (lift hoist5 crate2 crate1 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 crate1)
   added: (lifting hoist5 crate2) (clear crate1)
   goals met: 2 of 6
20. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 3 of 6
21. (lift hoist5 crate1 pallet7 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet7)
   added: (lifting hoist5 crate1) (clear pallet7)
   goals met: 3 of 6
22. (load hoist5 crate1 truck1 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck1) (available hoist5)
   goals met: 3 of 6
23. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 3 of 6
24. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   goals met: 3 of 6
25. (drop hoist4 crate0 pallet9 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet9)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet9)
   goals met: 4 of 6
26. (unload hoist4 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist4)
   added: (lifting hoist4 crate1)
   goals met: 4 of 6
27. (drop hoist4 crate1 pallet4 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet4)
   goals met: 5 of 6
28. (drop hoist7 crate5 crate0 distributor1)
   deleted: (lifting hoist7 crate5) (clear crate0)
   added: (available hoist7) (at crate5 distributor1) (clear crate5) (on crate5 crate0)
   goals met: 6 of 6
